ads/traveling_salesman_problem.html
---
layout: page
title: Traveling_salesman_problem
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Traveling Salesman Problem (TSP)</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>geg</b>: Knotenmenge \(V=\\{1,...,n\\}\) und Distanzen
\(d(i,j) \in \mathbb{Z} \cup \\{\infty\\}\) für alle
\(i,j \in \\{1,...,n\\}\), sowie ein Startknoten \(s \in V\). Es gilt die
Dreiecksungleichung \(\forall i,j,k \in V: d(i,k) \leq d(i,j) + d(j,k)\)
</p>

<p>
<b>ges</b>: Eine Rundreise, die jeden Knoten genau einmal besucht und zum
Startknoten zurück läuft. Eine Lösung ist also eine
<a href="../mathe/permutation">Permutation</a> \(\pi \in S_{n}\) von
\(\\{1,...,n\\}\). Der Wert (d.h. die Länge) einer Lösung \(\pi\) ist:
\(\sum_{i=1}^{n} d(\pi(i),\pi(i+1))\), wobei \(\pi(n+1) = \pi(1)\).
</p>

<p>
Wir erzeugen aus den Knoten in \(V\) und den Distanzen einen vollständigen
ungerichteten Graph \(K_{n} = (V,E)\).
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Eulerkreis</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Sei \(G=(V,E)\) ein Multigraph (d.h., mit evtl. parallelen Kanten), dann
heißt ein Pfad, der jede Kante von \(G\) genau einmal enthält <i>Eulerkreis</i>
(ein Eulerkreis ist kein einfacher Kreis, da Knotenwiederholungen
zulässig sind!)
</p>

<p>
Ein Multigraph, der einen Eulerkreis besitzt, heißt <i>Eulersch</i>.
</p>

<p>
<b>Satz von Euler:</b> Es sei \(G\) ein zusammenhängender Multigraph, dann sind
äquivalent:
</p>

<ul class="org-ul">
<li>\(G\) ist eulersch
</li>
<li>jeder Knoten von \(G\) hat gerade Grad
</li>
<li>die Kantenmenge von \(G\) kann in Kreise zerlegt werden
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Matching</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Ein <i>Matching</i> in einem Graphen \(G=(V,E)\) ist eine Menge
\(E' \subseteq E\) von Kanten, von denen keine zwei Kanten einen Endpunkt
gemeinsam haben. Bei Gewichten \(d(i,j)\) auf Kanten sei
\(d(E') = \sum_{(i,j) \in E'}\) das Gewicht von \(E'\).
</p>

<p>
Ein Matching heißt <i>perfekt</i>, falls jeder Knoten \(v \in V\) dabei
überdeckt wird, also \(2|E'| = |V|\) gilt.
</p>

<p>
<b>Laufzeit:</b> Ein perfektes Matching in \(G\) (sofern es existiert) mit min.
Gewicht kann in Zeit \(\mathcal{O}(|V|^3)\) berechnet werden.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Bestimmen von Rundreisen</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Die <i>MST-Heuristik</i> wird auch "Algorithmus \(\Delta\text{TSP}\_{1}\)"
genannt. Der Algorithmus von Christofides wird auch "Alogrithmus
\(\Delta\text{TSP}\_{2}\)" genannt.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> MST-Heurisitk</h4>
<div class="outline-text-4" id="text-1-3-1">
<ol class="org-ol">
<li>finde einen min. spannenenden Baum \(T\) in \(K_n\) (z.B. mit dem
Algorithmus von
<i>Jarnik-Prim</i>
oder
<i>Kruskal</i>)
</li>
<li>konstruiere einen Multigraph \(G\) aus \(T\) durch Verdoppeln aller
Kanten
</li>
<li>bestimme einen beliebigen Eulerschen Kreis \(K\) in \(G\) (im Folgenden
wird \(K\) auch <i>Tour</i> genannt). Beginne dabei bei Knoten \(s\).
</li>
<li>bestimme aus \(K\) ein Rundreise \(R\) durch sog. <i>Abkürzungen</i> (engl.
<i>shortcuts</i>). D.h beginne bei Knoten \(s\). Wenn ein Knoten wiederholt
besucht werden soll, überspringe diesen Knoten stattdessen und gehe
zum nächsten unbesuchten Knoten.
</li>
</ol>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>\(d(T) \leq opt(I)\), wobei \(d(T)\) das Gesamtgewicht aller Kanten von
\(T\) und \(opt(I)\) die Länge der optimalen Rundreise ist <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</li>
<li>\(d(K) \leq 2 \cdot d(T) \leq 2 \cdot opt(I)\), wobei \(d(K)\) die Länge
des eulerschen Kreises \(K\) ist.
</li>
<li>\(d(R) \leq d(K)\), wobei \(d(R)\) die Länge der Rundreise ist <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>. Also
hat der Algortihmus eine multiplikative Güte von 2, d.h.
\(d(R) \leq 2 \cdot opt(I)\).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Algorithmus von Christofides</h4>
<div class="outline-text-4" id="text-1-3-2">
<ol class="org-ol">
<li>finde einen min. spannenenden Baum \(T\) in \(K_n\) (z.B. mit dem
Algorithmus von
<i>Jarnik-Prim</i>
oder
<i>Kruskal</i>)
</li>
<li>bestimme die Menge \(X\) der Knoten, die in \(T\) ungeraden Grad haben.
</li>
<li>erzeuge einen vollständigen Graphen \(H\) auf \(X\) mit Gewicht \(d(i,j)\)
   für \(i,j \in X \wedge i \neq j\)
</li>
<li>bestimme ein perfektes Matching \(K\) mit min. Gewicht in \(H\)
</li>
<li>konstruiere einen Multigraph \(G\) aus \(T\) durch Hinzufügen der Kanten
aus \(K\) entsteht
</li>
<li>bestimme einen beliebigen Eulerschen Kreis \(C\) in \(G\) (im Folgenden
wird \(C\) auch <i>Tour</i> genannt). Beginne dabei bei Knoten \(s\).
</li>
<li>Bestimme eine Rundreise \(R\) durch Abkürzungen.
</li>
</ol>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>\(d(C) \leq d(T) + d(K) \leq opt(I) + d(K)\), wobei &#x2026;
</li>
<li>Der Algorithmus von Cristofides hat multiplikative Güte 1,5, d.h. es
gilt \(d(R) \leq 1.5 \cdot opt(I)\).
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Begründung: lässt man bei der optimalen Rundreise eine Kante weg, so
ergibt sich ein spannender Baum von \(G\). Dessen Gesamtgewicht ist
größer oder gleich \(d(T)\), da \(T\) minimal ist.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Begründung: Dreiecksungleichung
</p></div>


</div>
</div>
